//начало текста модуля

#Область Служебные_функции_и_процедуры

&НаКлиенте
// контекст фреймворка Vanessa-Behavior
Перем Ванесса;
 
&НаКлиенте
// Структура, в которой хранится состояние сценария между выполнением шагов. Очищается перед выполнением каждого сценария.
Перем Контекст Экспорт;
 
&НаКлиенте
// Структура, в которой можно хранить служебные данные между запусками сценариев. Существует, пока открыта форма Vanessa-Behavior.
Перем КонтекстСохраняемый Экспорт;

&НаКлиенте
// Функция экспортирует список шагов, которые реализованы в данной внешней обработке.
Функция ПолучитьСписокТестов(КонтекстФреймворкаBDD) Экспорт
	Ванесса = КонтекстФреймворкаBDD;
	
	ВсеТесты = Новый Массив;

	//описание параметров
	//Ванесса.ДобавитьШагВМассивТестов(ВсеТесты,Снипет,ИмяПроцедуры,ПредставлениеТеста,Транзакция,Параметр);

	Ванесса.ДобавитьШагВМассивТестов(ВсеТесты,"ПоступилВбросОтЗаказчика()","ПоступилВбросОтЗаказчика","Дано Поступил вброс от заказчика");
	Ванесса.ДобавитьШагВМассивТестов(ВсеТесты,"ЯОбрабатываюВброс()","ЯОбрабатываюВброс","Когда я обрабатываю вброс");
	Ванесса.ДобавитьШагВМассивТестов(ВсеТесты,"ЯСначалаФормируюFeature_файл()","ЯСначалаФормируюFeature_файл","Тогда я сначала формирую feature-файл");
	Ванесса.ДобавитьШагВМассивТестов(ВсеТесты,"ТолькоПотомНачинаюРазрабатыватьФункциональность()","ТолькоПотомНачинаюРазрабатыватьФункциональность","И только потом начинаю разрабатывать Функциональность");
	Ванесса.ДобавитьШагВМассивТестов(ВсеТесты,"_()","_","Когда");

	Возврат ВсеТесты;
КонецФункции
	
&НаСервере
// Служебная функция.
Функция ПолучитьМакетСервер(ИмяМакета)
	ОбъектСервер = РеквизитФормыВЗначение("Объект");
	Возврат ОбъектСервер.ПолучитьМакет(ИмяМакета);
КонецФункции
	
&НаКлиенте
// Служебная функция для подключения библиотеки создания fixtures.
Функция ПолучитьМакетОбработки(ИмяМакета) Экспорт
	Возврат ПолучитьМакетСервер(ИмяМакета);
КонецФункции

#КонецОбласти



#Область Работа_со_сценариями

&НаКлиенте
// Процедура выполняется перед началом каждого сценария
Процедура ПередНачаломСценария() Экспорт
	
КонецПроцедуры

&НаКлиенте
// Процедура выполняется перед окончанием каждого сценария
Процедура ПередОкончаниемСценария() Экспорт
	
КонецПроцедуры

#КонецОбласти


///////////////////////////////////////////////////
//Реализация шагов
///////////////////////////////////////////////////

&НаКлиенте
//Дано Поступил вброс от заказчика
//@ПоступилВбросОтЗаказчика()
Процедура ПоступилВбросОтЗаказчика() Экспорт
	//Ванесса.ПосмотретьЗначение(Парам01,Истина);
КонецПроцедуры

&НаКлиенте
//Когда я обрабатываю вброс
//@ЯОбрабатываюВброс()
Процедура ЯОбрабатываюВброс() Экспорт
	//Ванесса.ПосмотретьЗначение(Парам01,Истина);
	ВызватьИсключение "ошибка";
КонецПроцедуры

&НаКлиенте
//Тогда я сначала формирую feature-файл
//@ЯСначалаФормируюFeature_файл()
Процедура ЯСначалаФормируюFeature_файл() Экспорт
	//Ванесса.ПосмотретьЗначение(Парам01,Истина);
	ВызватьИсключение "Не реализовано.";
КонецПроцедуры

&НаКлиенте
//И только потом начинаю разрабатывать Функциональность
//@ТолькоПотомНачинаюРазрабатыватьФункциональность()
Процедура ТолькоПотомНачинаюРазрабатыватьФункциональность() Экспорт
	//Ванесса.ПосмотретьЗначение(Парам01,Истина);
	ВызватьИсключение "Не реализовано.";
КонецПроцедуры

&НаКлиенте
//Когда
//@_()
Процедура _() Экспорт
	//Ванесса.ПосмотретьЗначение(Парам01,Истина);
	ВызватьИсключение "Не реализовано.";
КонецПроцедуры

//окончание текста модуля